#
# @file ~/share/dotfile/Brewfile
# @brief instllation list of brew, cask, mas
#

cask_args appdir: '/Applications'
tap "heroku/brew"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions"
brew "anyenv"
brew "awscli"
brew "bats"
brew "emacs"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "jq"
brew "openssl"
brew "mas"
brew "maven"
brew "nkf"
brew "pipenv"
brew "reattach-to-user-namespace"
brew "tmux"
brew "tomcat"
brew "tree"
brew "vim"
brew "yq"
brew "zplug"
brew "zsh"
brew "heroku/brew/heroku"
cask "1password"
cask "bettertouchtool"
cask "docker"
cask "dropbox"
cask "eclipse-jee"
cask "firefox"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "hyper"
cask "iterm2"
cask "java11"
cask "kap"
cask "karabiner-elements"
cask "skype"
cask "visual-studio-code"
cask "wireshark"
mas "BetterSnapTool", id: 417375580
mas "DaisyDisk", id: 411643860
mas "ForkLift", id: 412448059
mas "Keynote", id: 409183694
mas "MenuBar Stats", id: 714196447
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "Tweetbot", id: 1384080005
mas "Xcode", id: 497799835
