#
# @file ~/share/dotfiles/Brewfile
# @brief homebrew-bundle configuration file
#

# Add repository
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# configuration manager
brew "mackup"
brew "mas"

# virtual env
brew "mise"
brew "pipenv"

# shell
brew "bash"
brew "zsh"
brew "sheldon"
brew "starship"
brew "tmux"

# git
brew "git"
brew "git-secrets"
brew "ghq"
brew "gh"

# cui
brew "bat"
brew "eza"
brew "fzf"
brew "gawk"
brew "gnu-sed"
brew "grep"
brew "jq"
brew "nkf"
brew "tree"
brew "xdg-ninja"
brew "yq"

# gui
cask "1password", args: { appdir: "/Applications" }
cask "canva"
cask "chatgpt"
cask "claude"
cask "clipy"
cask "cursor"
cask "dbeaver-community"
cask "docker-desktop", args: { appdir: "/Applications" }
cask "dropbox", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "font-hack-nerd-font"  # for starship
cask "ghostty"
cask "google-chrome", args: { appdir: "/Applications" }
cask "google-drive"
cask "google-japanese-ime", args: { appdir: "/Applications" }
cask "insomnia"
cask "intellij-idea-ce"
cask "iterm2", args: { appdir: "/Applications" }
cask "karabiner-elements", args: { appdir: "/Applications" }    # for US keybord language switching
cask "notion"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "wezterm"
cask "wireshark-app", args: { appdir: "/Applications" }
cask "zoom", args: { appdir: "/Applications" }

# app store
mas "DaisyDisk", id: 411643860
mas "ForkLift", id: 412448059
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835